; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v2 ?v7)
             (pred_9 ?v11 ?v3)
             (pred_7 ?v2 ?v3)
             (pred_4 ?v12 ?v2 )
	     (pred_6 ?v2)
             (pred_12 ?v1)
             (pred_1 ?v11)
             (pred_11 ?v3)
             (pred_5 ?v2)
             (pred_2 ?v11)
             (pred_10 ?v2)
             (pred_3 ))



(:action op_3
:parameters (?v5 ?v10 ?v13 ?v4)
:precondition (and (pred_12 ?v5) (pred_12 ?v10) (pred_1 ?v13) (pred_11 ?v4)
          (pred_8 ?v5 ?v10) (pred_9 ?v13 ?v4)
                   (pred_7 ?v10 ?v4) (pred_6 ?v5) 
                   (pred_5 ?v10) (pred_2 ?v13))
:effect (and  (pred_10 ?v10) (not (pred_5 ?v10))))


(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_12 ?v5) (pred_12 ?v9)
               (pred_6 ?v5) (pred_8 ?v5 ?v9) (pred_10 ?v9))
:effect (and (pred_6 ?v9) (not (pred_6 ?v5))))

(:action op_5
:parameters (?v5 ?v13)
:precondition (and (pred_12 ?v5) (pred_1 ?v13) 
                  (pred_6 ?v5) (pred_4 ?v13 ?v5) (pred_3 ))
:effect (and (pred_2 ?v13)
   (not (pred_4 ?v13 ?v5)) (not (pred_3 ))))


(:action op_1
:parameters (?v5 ?v6 ?v8)
:precondition (and (pred_12 ?v5) (pred_1 ?v6) (pred_1 ?v8)
                  (pred_6 ?v5) (pred_2 ?v8) (pred_4 ?v6 ?v5))
:effect (and (pred_2 ?v6) (pred_4 ?v8 ?v5)
        (not (pred_2 ?v8)) (not (pred_4 ?v6 ?v5))))

(:action op_2
:parameters (?v5 ?v13)
:precondition (and (pred_12 ?v5) (pred_1 ?v13) 
                  (pred_6 ?v5) (pred_2 ?v13))
:effect (and (pred_3 ) (pred_4 ?v13 ?v5) (not (pred_2 ?v13)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_20 obj_12 obj_11 obj_15 obj_17 obj_01 obj_08 obj_13 obj_21 obj_02 obj_09 obj_04 obj_18 obj_07 obj_14
    obj_16 obj_05
    obj_03 obj_10 obj_19
    )

    (:init
       (pred_3)

       (pred_12 obj_06)
       (pred_12 obj_20)
       (pred_12 obj_12)
       (pred_12 obj_11)
       (pred_12 obj_15)
       (pred_12 obj_17)
       (pred_12 obj_01)
       (pred_12 obj_08)
       (pred_12 obj_13)
       (pred_12 obj_21)
       (pred_12 obj_02)
       (pred_12 obj_09)
       (pred_12 obj_04)
       (pred_12 obj_18)
       (pred_12 obj_07)
       (pred_12 obj_14)
       (pred_11 obj_16)
       (pred_11 obj_05)
       (pred_1 obj_03)
       (pred_1 obj_10)
       (pred_1 obj_19)

       (pred_8 obj_06 obj_15)
       (pred_8 obj_06 obj_20)
       (pred_8 obj_20 obj_17)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_20 obj_06)
       (pred_8 obj_12 obj_01)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_11 obj_08)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_15 obj_13)
       (pred_8 obj_15 obj_17)
       (pred_8 obj_15 obj_06)
       (pred_8 obj_17 obj_21)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_17 obj_20)
       (pred_8 obj_17 obj_15)
       (pred_8 obj_01 obj_02)
       (pred_8 obj_01 obj_08)
       (pred_8 obj_01 obj_12)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_08 obj_11)
       (pred_8 obj_08 obj_01)
       (pred_8 obj_13 obj_04)
       (pred_8 obj_13 obj_21)
       (pred_8 obj_13 obj_15)
       (pred_8 obj_21 obj_18)
       (pred_8 obj_21 obj_02)
       (pred_8 obj_21 obj_17)
       (pred_8 obj_21 obj_13)
       (pred_8 obj_02 obj_07)
       (pred_8 obj_02 obj_09)
       (pred_8 obj_02 obj_01)
       (pred_8 obj_02 obj_21)
       (pred_8 obj_09 obj_14)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_09 obj_02)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_18 obj_07)
       (pred_8 obj_18 obj_21)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_07 obj_02)
       (pred_8 obj_07 obj_18)
       (pred_8 obj_14 obj_09)
       (pred_8 obj_14 obj_07)
       (pred_5 obj_17)
       (pred_5 obj_08)
       (pred_5 obj_12)
       (pred_7  obj_17 obj_16)
       (pred_7  obj_08 obj_05)
       (pred_7  obj_12 obj_05)
       (pred_10 obj_06)
       (pred_10 obj_20)
       (pred_10 obj_11)
       (pred_10 obj_15)
       (pred_10 obj_01)
       (pred_10 obj_13)
       (pred_10 obj_21)
       (pred_10 obj_02)
       (pred_10 obj_09)
       (pred_10 obj_04)
       (pred_10 obj_18)
       (pred_10 obj_07)
       (pred_10 obj_14)

       (pred_9  obj_03 obj_16)
       (pred_9  obj_10 obj_05)
       (pred_9  obj_19 obj_16)
       (pred_4 obj_03 obj_18)
       (pred_4 obj_10 obj_06)
       (pred_4 obj_19 obj_02)
       (pred_6 obj_09)
    )

    (:goal (and
       (pred_4 obj_03 obj_13)
       (pred_4 obj_10 obj_14)
    ))
(:constraints
  (always (not (pred_6 obj_21)))
)
)

; plan
1. (op_4 obj_09 obj_14)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_14)
   goals met: 0 of 2
2. (op_4 obj_14 obj_07)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_07)
   goals met: 0 of 2
3. (op_4 obj_07 obj_18)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_18)
   goals met: 0 of 2
4. (op_5 obj_18 obj_03)
   deleted: (pred_4 obj_03 obj_18) (pred_3)
   added: (pred_2 obj_03)
   goals met: 0 of 2
5. (op_4 obj_18 obj_04)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_04)
   goals met: 0 of 2
6. (op_4 obj_04 obj_13)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_13)
   goals met: 0 of 2
7. (op_2 obj_13 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_3) (pred_4 obj_03 obj_13)
   goals met: 1 of 2
8. (op_4 obj_13 obj_15)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_15)
   goals met: 1 of 2
9. (op_4 obj_15 obj_06)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_06)
   goals met: 1 of 2
10. (op_5 obj_06 obj_10)
   deleted: (pred_4 obj_10 obj_06) (pred_3)
   added: (pred_2 obj_10)
   goals met: 1 of 2
11. (op_4 obj_06 obj_15)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_15)
   goals met: 1 of 2
12. (op_4 obj_15 obj_13)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_13)
   goals met: 1 of 2
13. (op_4 obj_13 obj_04)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_04)
   goals met: 1 of 2
14. (op_4 obj_04 obj_18)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_18)
   goals met: 1 of 2
15. (op_4 obj_18 obj_07)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_07)
   goals met: 1 of 2
16. (op_4 obj_07 obj_14)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_14)
   goals met: 1 of 2
17. (op_2 obj_14 obj_10)
   deleted: (pred_2 obj_10)
   added: (pred_3) (pred_4 obj_10 obj_14)
   goals met: 2 of 2
